README.md
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. emacs-stuff</a>
<ul>
<li><a href="#sec-1-1">1.1. Useful Links</a></li>
<li><a href="#sec-1-2">1.2. Themes</a></li>
</ul>
</li>
</ul>
</div>
</div>

# emacs-stuff<a id="sec-1" name="sec-1"></a>

This is a repository of stuff/notes I will be collecting while learning emacs

## Useful Links<a id="sec-1-1" name="sec-1-1"></a>

-   Emacs website: [GNU Emacs](https://www.gnu.org/software/emacs/)
-   Emacs wiki: [Emacs Wiki](https://www.emacswiki.org/emacs/)
-   Emacs manual: [GNU Emacs Manual](https://www.gnu.org/software/emacs/manual/html_node/emacs/index.html)
-   org-mode: [org-mode home](https://orgmode.org/)
-   org-mode talk by Harry Schwartz: [Getting started with org-mode](https://www.youtube.com/watch?v%3DSzA2YODtgK4&index%3D4&t%3D688s&list%3DWL)
-   Emacs cheat sheet ref card: [[<https://www.gnu.org/software/emacs/refcards/pdf/refcard.pdf][Reference> Card]

## Themes<a id="sec-1-2" name="sec-1-2"></a>

I like to tweak emacs to the theme that I like. Here are some beautiful themes that I've tried (themes directory contains source code for some of them)
-   [Spacemacs theme](https://github.com/nashamri/spacemacs-theme)
-   [Darktooth theme](https://github.com/emacsfodder/Emacs-theme-Darktooth)
-   [Doom theme](https://github.com/hlissner/emacs-doom-themes)
-   [Material theme](https://github.com/cpaulik/emacs-material-theme)

In addition to above, [here](https://emacsthemes.com/) is a themes gallery for emacs which contains tons of themes.